# SQL - stringi i joiny
_Mikołaj Leszczuk_

## Konspekt

* Operacje na stringach (+ćwiczenia)
* Łączenie tabel i wyszukiwanie danych w wielu tabelach (+ćwiczenia)
* Zadania utrwalające 2

## Operacje na stringach

Tu doświadczymy istotnych różnic pomiędzy implementacjami DBMS!

In [ ]:
%CREATE osoby.db rw

In [ ]:
%LOAD osoby.db rw

In [ ]:
DELETE FROM osoby;

In [ ]:
CREATE TABLE "osoby" (
    "imię"     VARCHAR,
    "nazwisko" VARCHAR,
    "wiek"     TINYINT
);

In [ ]:
SELECT * FROM osoby;

In [ ]:
INSERT INTO osoby VALUES ("Paweł", "Kowalski", 3);

In [ ]:
INSERT INTO osoby VALUES ("Piotr", "Janik", 7);

In [ ]:
INSERT INTO osoby VALUES ("Michał", "Nowak", 13);

In [ ]:
SELECT * FROM osoby;

### `CONCAT()`

Czasem jest potrzeba wyświetlenia konkatenacji kolumn i jakiegoś łańcucha tekstowego. Do tego może przydać się funkcja `CONCAT()`.

Składnia operatora konkatenacji różni się od siebie w bazach danych:

* Oracle: `CONCAT()` lub `||`
* MySQL: `CONCAT()`
* SQL Server: `+`
* SQLite: `||`

#### Składnia dla MySQL/Oracle

```mysql
SELECT CONCAT(nazwa_kolumny1,nazwa_kolumny2) FROM nazwa_tabeli;
```

##### Przykład

```mysql
CONCAT()
```

**Wyświetl tekst powstały z połączenia imienia z nazwiskiem**

Tabela **``Osoby``**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania SQLite:

In [ ]:
SELECT CONCAT(imię,nazwisko) FROM osoby;

Zapytanie i wynik zapytania MySQL/Oracle:

```mysql
SELECT CONCAT(imię,nazwisko) FROM osoby;
```

|     CONCAT(imię,nazwisko)    |
|:----------------------------:|
|     PawełKowalski            |
|     PiotrJanik               |
|     MichałNowak              |

W Oracle funkcja `CONCAT()` przyjmuje wyłącznie 2 argumenty. Problem można ominąć używając operatora `||` dostępnego tylko w Oracle i SQLite.

#### Składnia użycia operatora `||` w Oracle/SQLite

```sql
SELECT 'dowolny_tekst'||nazwa_kolumny1||'dowolny_tekst'||nazwa_kolumny2 FROM nazwa_tabeli;
```

##### Przykład

Użycie `||` w Oracle/SQLite

**Wyświetl imię i nazwisko oddzielone spacją `(" ")`**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT imię||' '||nazwisko FROM osoby;

#### Składnia dla SQL Server

```sql
SELECT 'dowolny_tekst'+nazwa_kolumny1+'dowolny_tekst'+ nazwa_kolumny2 FROM nazwa_tabeli;
```

##### Przykład

Użycie `+` w SQL Server

**Wyświetl imię i nazwisko oddzielone spacją `(" ")`**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania SQLite:

In [ ]:
SELECT imię+' '+nazwisko FROM osoby;

Zapytanie i wynik zapytania SQL Server:

```sql
SELECT imię+' '+nazwisko FROM osoby;
```

|     imię+' '+nazwisko    |
|:------------------------:|
|     Paweł   Kowalski     |
|     Piotr   Janik        |
|     Michał   Nowak       |

#### Ćwiczenie

**Wyświetl bez powtórzeń imię i nazwisko oddzielone spacją `(" ")`**

Tabela **`Simple_library_db`**:

[00 SQL - Reset.ipynb](00%20SQL%20-%20Reset.ipynb)

In [ ]:
%LOAD simple_library_db.db rw

In [ ]:
SELECT * FROM simple_library_db;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT DISTINCT author_name || ' ' || author_surname FROM simple_library_db;

### `LOWER(nazwa_kolumny)` i `UPPER(nazwa_kolumny)`

Funkcja zwraca wartość kolumny tekstowej w postaci małych/dużych liter.

Składnia:

```sqlite
SELECT LOWER(nazwa_kolumny) FROM nazwa_tabeli;
```

```sqlite
SELECT UPPER(nazwa_kolumny) FROM nazwa_tabeli;
```

#### Przykład

```sql
LOWER()
```

**Wyświetl wszystkie nazwiska małymi literami**

Tabela **`Osoby`**:

In [ ]:
%LOAD osoby.db rw

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT LOWER(nazwisko) FROM osoby;

#### Przykład

```sql
UPPER()
```

**Wyświetl wszystkie nazwiska dużymi literami**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT UPPER(nazwisko) FROM osoby;

#### Ćwiczenie

**Wyświetl bez powtórzeń imię małymi literami i nazwisko dużymi literami**

Tabela **`Simple_library_db`**:

In [ ]:
%LOAD simple_library_db.db rw

In [ ]:
SELECT * FROM simple_library_db;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT DISTINCT LOWER(author_name), UPPER(author_surname) FROM simple_library_db;

### `LENGTH(nazwa_kolumny)`

Funkcja zwraca długość pola tekstowego podanego jako argument

Składnia:

```sqlite
SELECT LENGTH(nazwa_kolumny) FROM nazwa_tabeli;
```

W SQL Server używa się do tego samego funkcji `LEN()`

#### Przykład

```sql
LENGTH()
```

**Wyświetl nazwisko i odpowiadającą jemu długość nazwiska**

Tabela **`Osoby`**:

In [ ]:
%LOAD osoby.db rw

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT nazwisko,LENGTH(nazwisko) FROM osoby;

### `REPLACE(str1,str2,str3)`

Funkcja przeszukuje `str1` w poszukiwaniu `str2` aby go zamienić na `str3`

Składnia:

```sqlite
SELECT REPLACE(nazwa_kolumny,'str2','str3') FROM nazwa_tabeli;
```

#### Przykład

```sql
REPLACE()
```

**Wyświetl imiona i nazwiska z tym że zamiast imienia Michał wyświetl Michael**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT REPLACE(imię,'Michał','Michael'), nazwisko FROM osoby;

### `SUBSTR(nazwa_kolumny,pozycja[,liczba_znaków])`

Funkcja ta służy do operacji na łańcuchach tekstowych w wyniku zapytań. Może przyjmować 2-3 argumentów.

```sql
SUBSTR(nazwa_kolumny,pozycja[,liczba_znaków])
```

`nazwa_kolumny` - łańcuch tekstowy do obcięcia

`pozycja` - nr znaku od którego ma być wyświetlony string

`liczba_znaków` - argument opcjonalny, liczba znaków do wyświetlenia, liczona od parametru pozycja

W Oracle oraz w niektórych wersjach MySQL używa się funkcji `SUBSTRING()`

Natomiast w MS Access stosuje się `MID()`

Składnia:

```sqlite
SELECT SUBSTR(nazwa_kolumny,pozycja[,liczba_znaków]) FROM nazwa_tabeli;
```

#### Przykład

```sqlite
SUBSTR()
```

**Wyświetl dwie pierwsze litery z nazwiska**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT SUBSTR(nazwisko,1,2) FROM osoby;

## Łączenie tabel i wyszukiwanie danych w wielu tabelach

Czasem potrzebujemy wybrać dane z tabeli w zależności od danych pochodzących z innej tabeli. Do rozwiązania tego problemu służy operacja zwana **łączeniem (`JOIN`)**.

Jeśli w zapytaniu potrzebne nam są dane z `tabeli1` i `tabeli2` to musimy wpisać ich nazwy zaraz po słowie `FROM` (tak jak to robimy w standardowych zapytaniach) a następnie odwoływać się do kolumn z tych tabel używając: nazwy konkretnej tabeli, operatora kropki “`.`” oraz nazwy żądanej kolumny.

```sqlite
SELECT tabela.kolumna,tabela2.kolumna FROM tabela,tabela2 ON tabela2.kolumna=tabela.kolumna
```

Operator “`,`” jest skrótem od słowa kluczowego `JOIN`, które oznacza zebranie wymienionych tabel w jedną dużą i operowanie na niej.

Możliwe jest łączenie trzech i więcej tabel. Działa to analogicznie jak w przypadku dwóch tabel.

`JOIN` łączy rekordy z dwóch kolumn w jeden na podstawie podanego warunku

#### Przykład

**Łączymy rekordy z tabel `Authors` i `Titles` w jedną tabelę na podstawie podanego warunku równości `authors.id` i `titles.author_id`**

Tabela **`Authors`**:

In [ ]:
%LOAD library_db.db rw

In [ ]:
SELECT * FROM authors;

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Zapytanie i wynik zapytania:

In [ ]:
SELECT * FROM authors JOIN titles ON authors.ID=titles.author_id;

#### Ćwiczenie

**Znajdź nazwisko i tytuły książek napisanych przez autora o identyfikatorze 3**

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Tabela **`Authors`**:

In [ ]:
SELECT * FROM authors;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT authors.surname,titles.title FROM authors JOIN titles ON authors.ID=titles.author_id
WHERE titles.author_id="3";

#### Ćwiczenie

**Znajdź imiona, nazwiska i tytuły książek napisanych przez autorów o imieniu rozpoczynającym się na “`S`”**

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Tabela **`Authors`**:

In [ ]:
SELECT * FROM authors;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT authors.name,authors.surname,titles.title FROM authors JOIN titles
ON authors.ID=titles.author_id WHERE authors.name LIKE 'S%';

### Łączenie tabel z użyciem aliasów

```sql
SELECT tab.kolumna FROM tabela AS tab,tabela2 AS tab2 WHERE tab2.kolumna=wartość;
```

#### Przykład

**Podajemy id, nazwę i ilość zamówionych produktów w zamówieniu o id `4` korzystając z aliasów dla tabel `Order_product` i `Product`**

Tabela **`Order_product`**:

In [ ]:
%LOAD CodeBrainers.db rw

In [ ]:
SELECT * FROM order_product;

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT p.id, p.name, op.amount FROM order_product AS op, product AS p
WHERE op.order_id = 4 AND p.id = op.product_id;

## Zadania utrwalające 2

### Ćwiczenia

[`02_joins.md`](https://github.com/pkociepka/sql/blob/master/exercises/02_joins.md)

### Materiały

[`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql)

Schemat bazy danych z pliku [`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql) znajdziesz w pliku [`library_db_scheme.png`](https://github.com/pkociepka/sql/blob/master/library_db_schema.png)

![](https://raw.githubusercontent.com/pkociepka/sql/master/library_db_schema.png)